# Raw Data Loading
### Libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
f = './Resources/all_races05_19.csv'
X = pd.read_csv(f)

C:\Anaconda38\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (1,22) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

#### base don the various columns explored, it is clearly necessary to develop a model which combines both fundamental features of each horse and market generated information.
## In order to test the hypothesis that racetrack betting market is semi-strong
form efficient, it is clearly necessary to develop a model which combines both
fundamental and market-generated information. The merDeve;its of combining this
information in a one-step model are not only its simplicity but also the
opportunity it affords for examining the significance of each individual
fundamental variable in an explicit manner; since probabilities derived from
the final market odds also appear in the model. This facilitates understanding
of how bettors utilise publicly available information

##  DEFINITIONS OF THE INDEPENDENT VARIABLES EMPLOYED IN THE ONE- AND
TWO-STEP MODELS
Independent variable Variable definitions
Market-generated variable
ln ðpsij ÞThe natural logarithm of the normalised final odds probability
Fundamental variables
pre_s_ra Speed rating for the previous race in which the horse ran
avgsr4 The average of a horse’s speed rating in its last 4 races; zero when
there is no past run
draw Post-position in current race
eps Total prize money earnings (finishing first, second or third) to
date/Number of races entered
newdis 1 indicates a horse that ran three or four of its last four races at a
distance of 80% less than current distance, and 0 otherwise
weight Weight carried by the horse in current race
win_run The percentage of the races won by the horse in its career
jnowin The number of wins by the jockey in career to date of race
jwinper The winning percentage of the jockey in career to date of race
jst1miss 1 indicates when the other jockey variables are missing; 0 otherwise
THE JOURNAL OF PREDICTION MARKETS2007, 1 1
## This arises since it may become obvious to a jockey that
his/her mount will not finish in the first three (where prize money is awarded);
the jockey then has little incentive to ensure that the horse achieves its best
possible finish position. In fact, there may be positive incentives not to do this,
as it helps to conceal the horse’s true ability, which increases the value of the
horse’s connections’ (owners, trainers etc) private information (which they
can exploit in the betting ring in subsequent races). As a

In [3]:
X.head(2)

,race_ID,date,course,time,race_name,class,band,dist.f.,dist.m.,going,...,rpr,sire,dam,damsire,comment,dec_clean,prob,exp_chance,act_score,prize_money
0,RID1002-IE-05,2005-04-24,Cork,5:25,Coolmore Brian Boru (Pro-Am) INH Flat Race (Di...,NaN,4yo+,18.0,3600,Heavy,...,103.0,Un Desperado (FR),Connaught Lace (GB),Connaught,Tracked leaders - keen hold early - 2nd approa...,7.0,0.125,0.05585,1,8292.0
1,RID1002-IE-05,2005-04-24,Cork,5:25,Coolmore Brian Boru (Pro-Am) INH Flat Race (Di...,NaN,4yo+,18.0,3600,Heavy,...,106.0,Zaffaran (USA),Persian Argument (IRE),Persian Mews,Mid-division - progress into 3rd approaching s...,4.0,0.200,0.08936,0,1932.0

In [4]:
X.shape

(744347, 42)

In [5]:
X.dtypes

race_ID         object
date            object
course          object
time            object
race_name       object
class           object
band            object
dist.f.        float64
dist.m.          int64
going           object
season           int64
race_group      object
race_type       object
Month          float64
Year           float64
Period          object
Runners          int64
Race_Money     float64
horse_name      object
trainer         object
jockey          object
pos             object
btn             object
sp              object
dec            float64
age              int64
weight          object
lbs              int64
gear            object
fin_time        object
or             float64
ts             float64
rpr            float64
sire            object
dam             object
damsire         object
comment         object
dec_clean      float64
prob           float64
exp_chance     float64
act_score        int64
prize_money    float64
dtype: object

In [6]:
# Take a look at the column variable
X.columns

Index(['race_ID', 'date', 'course', 'time', 'race_name', 'class', 'band',
       'dist.f.', 'dist.m.', 'going', 'season', 'race_group', 'race_type',
       'Month', 'Year', 'Period', 'Runners', 'Race_Money', 'horse_name',
       'trainer', 'jockey', 'pos', 'btn', 'sp', 'dec', 'age', 'weight', 'lbs',
       'gear', 'fin_time', 'or', 'ts', 'rpr', 'sire', 'dam', 'damsire',
       'comment', 'dec_clean', 'prob', 'exp_chance', 'act_score',
       'prize_money'],
      dtype='object')

## Data Pre-processing

In [7]:
# Check categorical columns by obtaining unique object variables
for col_name in X.columns:
    if X[col_name].dtypes == 'object':
        unique_cat = len(X[col_name].unique())
        print("Feature '{col_name}' has {unique_cat} unique categories".format(col_name=col_name, unique_cat=unique_cat))

Feature 'race_ID' has 72896 unique categories
Feature 'date' has 4727 unique categories
Feature 'course' has 75 unique categories
Feature 'time' has 220 unique categories
Feature 'race_name' has 47228 unique categories
Feature 'class' has 70 unique categories
Feature 'band' has 57 unique categories
Feature 'going' has 13 unique categories
Feature 'race_group' has 4 unique categories
Feature 'race_type' has 2 unique categories
Feature 'Period' has 178 unique categories
Feature 'horse_name' has 79591 unique categories
Feature 'trainer' has 3766 unique categories
Feature 'jockey' has 3108 unique categories
Feature 'pos' has 41 unique categories
Feature 'btn' has 1758 unique categories
Feature 'sp' has 220 unique categories
Feature 'weight' has 99 unique categories
Feature 'gear' has 26 unique categories
Feature 'fin_time' has 30968 unique categories
Feature 'sire' has 2900 unique categories
Feature 'dam' has 43027 unique categories
Feature 'damsire' has 3793 unique categories
Feature 'comment' has 703853 unique categories

In [8]:
# Check unique numerical variables
for col_name in X.columns:
    if X[col_name].dtypes == 'float64':
        unique_cat = len(X[col_name].unique())
        print("Feature '{col_name}' has {unique_cat} unique categories".format(col_name=col_name, unique_cat=unique_cat))

Feature 'dist.f.' has 48 unique categories
Feature 'Month' has 13 unique categories
Feature 'Year' has 16 unique categories
Feature 'Race_Money' has 4721 unique categories
Feature 'dec' has 95 unique categories
Feature 'or' has 155 unique categories
Feature 'ts' has 181 unique categories
Feature 'rpr' has 192 unique categories
Feature 'dec_clean' has 95 unique categories
Feature 'prob' has 95 unique categories
Feature 'exp_chance' has 555032 unique categories
Feature 'prize_money' has 14962 unique categories

Based on the various columns explored, it is clearly necessary to develop a model which combines both fundamental features of each horse and market generated information.

In [9]:
X.head(2)

,race_ID,date,course,time,race_name,class,band,dist.f.,dist.m.,going,...,rpr,sire,dam,damsire,comment,dec_clean,prob,exp_chance,act_score,prize_money
0,RID1002-IE-05,2005-04-24,Cork,5:25,Coolmore Brian Boru (Pro-Am) INH Flat Race (Di...,NaN,4yo+,18.0,3600,Heavy,...,103.0,Un Desperado (FR),Connaught Lace (GB),Connaught,Tracked leaders - keen hold early - 2nd approa...,7.0,0.125,0.05585,1,8292.0
1,RID1002-IE-05,2005-04-24,Cork,5:25,Coolmore Brian Boru (Pro-Am) INH Flat Race (Di...,NaN,4yo+,18.0,3600,Heavy,...,106.0,Zaffaran (USA),Persian Argument (IRE),Persian Mews,Mid-division - progress into 3rd approaching s...,4.0,0.200,0.08936,0,1932.0

# Drop Irrelevant Columns

In [10]:
X_df = X.drop(['race_ID', 'class','time','dist.f.','Month', 'Year', 'Period', 'Runners','fin_time', 'dec','weight','dec_clean','sire', 'dam', 'damsire', 'comment','race_name','btn','sp','or','rpr','horse_name','exp_chance','prob'],axis=1)
X_df.head(2)

,date,course,band,dist.m.,going,season,race_group,race_type,Race_Money,trainer,jockey,pos,age,lbs,gear,ts,act_score,prize_money
0,2005-04-24,Cork,4yo+,3600,Heavy,5,Bumper,Even,11568.0,W P Mullins,Ms K Walsh,1,5,155,NaN,NaN,1,8292.0
1,2005-04-24,Cork,4yo+,3600,Heavy,5,Bumper,Even,11568.0,Thomas Gerard O'Leary,Robbie McNamara,2,5,160,NaN,NaN,0,1932.0

In [11]:
#Drop NaN Values
X_df = X_df.dropna()
X_df.shape

(140461, 18)

In [12]:
X_df.head(2)

,date,course,band,dist.m.,going,season,race_group,race_type,Race_Money,trainer,jockey,pos,age,lbs,gear,ts,act_score,prize_money
189,2005-06-02,Punchestown,4yo+ M,3200,Good To Firm,5,Hurdle,Handicap,11568.0,C A Murphy,A J Donoghue,3,5,157,t,93.0,0,852.0
191,2005-06-02,Punchestown,4yo+ M,3200,Good To Firm,5,Hurdle,Handicap,11568.0,C Roche,Mark Walsh,5,4,150,t,79.0,0,0.0

In [13]:
#Rename Columns
X_df.rename(columns={'date': 'Date', 'dist.m.': 'Distance', 'pos': 'Track_position', 'lbs': 'Weight', 'ts': 'Top_speed', 'act_score': 'Winner', 'going': 'Track_condition'}, inplace=True)

In [14]:
X_df.head(2)

,Date,course,band,Distance,Track_condition,season,race_group,race_type,Race_Money,trainer,jockey,Track_position,age,Weight,gear,Top_speed,Winner,prize_money
189,2005-06-02,Punchestown,4yo+ M,3200,Good To Firm,5,Hurdle,Handicap,11568.0,C A Murphy,A J Donoghue,3,5,157,t,93.0,0,852.0
191,2005-06-02,Punchestown,4yo+ M,3200,Good To Firm,5,Hurdle,Handicap,11568.0,C Roche,Mark Walsh,5,4,150,t,79.0,0,0.0

In [15]:
# print out object columns to know number of unique features
for col_name in X_df.columns:
    if X_df[col_name].dtypes == 'object':
        unique_cat = len(X_df[col_name].unique())
        print("Feature '{col_name}' has {unique_cat} unique categories".format(col_name=col_name, unique_cat=unique_cat))

Feature 'Date' has 4654 unique categories
Feature 'course' has 67 unique categories
Feature 'band' has 52 unique categories
Feature 'Track_condition' has 10 unique categories
Feature 'race_group' has 4 unique categories
Feature 'race_type' has 2 unique categories
Feature 'trainer' has 2306 unique categories
Feature 'jockey' has 1861 unique categories
Feature 'Track_position' has 30 unique categories
Feature 'gear' has 25 unique categories

In [16]:
#Print out numerical columns
for col_name in X_df.columns:
    if X_df[col_name].dtypes == 'float64':
        unique_cat = len(X_df[col_name].unique())
        print("Feature '{col_name}' has {unique_cat} unique categories".format(col_name=col_name, unique_cat=unique_cat))

Feature 'Race_Money' has 3781 unique categories
Feature 'Top_speed' has 175 unique categories
Feature 'prize_money' has 7206 unique categories

#### Reduce the number of unique values by binning 'rare' categorical variables on:
1. band
2. jockey
3. trainer
4. track condition

In [17]:
X_df["band"].value_counts()
# Reduce categorical variables (band)
band_others = X_df['band'].value_counts().loc[lambda x: x<13000]
application_to_replace = band_others.index.tolist()
for b in application_to_replace:
    X_df['band'] = X_df['band'].replace(b,"other")
# Confirm binning was successful
X_df['band'].value_counts(sort=True).reset_index()

   index   band
0   4yo+  81688
1   5yo+  34835
2  other  23938

In [18]:
X_df['jockey'].value_counts().head(7)
# Reduce categorical variables (jockey)
jockey_others = X_df['jockey'].value_counts().loc[lambda x: x<2700]
application_to_replace = jockey_others.index.tolist()
for j in application_to_replace:
    X_df['jockey'] = X_df['jockey'].replace(j,"other")
# Confirm binning was successful
X_df['jockey'].value_counts(sort=True).reset_index()

             index  jockey
0            other  134900
1  Richard Johnson    2792
2    Tom Scudamore    2769

In [19]:
X_df['trainer'].value_counts().head(10)
# Reduce categorical variables (trainer)
trainer_others = X_df['trainer'].value_counts().loc[lambda x: x<3000]
application_to_replace = trainer_others.index.tolist()
for t in application_to_replace:
    X_df['trainer'] = X_df['trainer'].replace(t,"other")
# Confirm binning was successful
X_df['trainer'].value_counts(sort=True).reset_index()

            index  trainer
0           other   133903
1  Gordon Elliott     3300
2      David Pipe     3258

In [20]:
X_df['Track_condition'].value_counts().head(10)
# Reduce categorical variables (Track_condition)
track_others = X_df['Track_condition'].value_counts().loc[lambda x: x<18000]
application_to_replace = track_others.index.tolist()
for t in application_to_replace:
    X_df['Track_condition'] = X_df['Track_condition'].replace(t,"other")
# Confirm binning was successful
X_df['Track_condition'].value_counts(sort=True).reset_index()

          index  Track_condition
0          Good            54537
1         other            42641
2          Soft            23510
3  Good To Soft            19773

In [21]:
# Reduce categorical variables (course)
X_df['course'].value_counts().head(10)
course_others = X_df['course'].value_counts().loc[lambda x: x<4000]
application_to_replace = course_others.index.tolist()
for c in application_to_replace:
    X_df['course'] = X_df['course'].replace(c,"other")
# Confirm binning was successful
X_df['course'].value_counts(sort=True).reset_index()

        index  course
0       other  123088
1   Uttoxeter    4904
2   Worcester    4324
3    Fontwell    4082
4  Cheltenham    4063

In [22]:
# Reduce categorical variables (gear)
X_df['gear'].value_counts().head(10)
gear_others = X_df['gear'].value_counts().loc[lambda x: x<10000]
application_to_replace = gear_others.index.tolist()
for g in application_to_replace:
    X_df['gear'] = X_df['gear'].replace(g,"other")
# Confirm binning was successful
X_df['gear'].value_counts(sort=True).reset_index()

   index   gear
0      t  47785
1      p  36663
2  other  25607
3      b  19504
4     tp  10902

In [23]:
#Replace Disqualified positon in the race with zero(0)
X_df["Track_position"].value_counts()

2      19628
3      19173
1      18976
4      17678
5      15594
6      12573
7       9682
8       7478
9       5603
10      4036
11      2979
12      2146
13      1519
14      1062
15       723
16       517
17       354
18       220
19       139
20        92
DSQ       90
21        76
22        59
23        28
24        15
26         8
25         8
27         2
28         2
REF        1
Name: Track_position, dtype: int64

In [24]:
# Replace disqualified position (DSQ) as 0
dX=X_df.replace(to_replace="DSQ",value=0)

In [25]:
dX.head(2)

,Date,course,band,Distance,Track_condition,season,race_group,race_type,Race_Money,trainer,jockey,Track_position,age,Weight,gear,Top_speed,Winner,prize_money
189,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,3,5,157,t,93.0,0,852.0
191,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,5,4,150,t,79.0,0,0.0

In [26]:
dX.dtypes

Date                object
course              object
band                object
Distance             int64
Track_condition     object
season               int64
race_group          object
race_type           object
Race_Money         float64
trainer             object
jockey              object
Track_position      object
age                  int64
Weight               int64
gear                object
Top_speed          float64
Winner               int64
prize_money        float64
dtype: object

In [27]:
# dX["pos"].value_counts()

In [28]:
# dX["btn"].unique()

In [29]:
# Replace string s03 in btn column with 53.3 (DSQ) as 26
#dX_df1=dX.replace(to_replace="s0.3",value=50.3)

In [30]:
dX.head(2)

,Date,course,band,Distance,Track_condition,season,race_group,race_type,Race_Money,trainer,jockey,Track_position,age,Weight,gear,Top_speed,Winner,prize_money
189,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,3,5,157,t,93.0,0,852.0
191,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,5,4,150,t,79.0,0,0.0

In [31]:
dX.dtypes

Date                object
course              object
band                object
Distance             int64
Track_condition     object
season               int64
race_group          object
race_type           object
Race_Money         float64
trainer             object
jockey              object
Track_position      object
age                  int64
Weight               int64
gear                object
Top_speed          float64
Winner               int64
prize_money        float64
dtype: object

In [32]:
dX["Track_position"].unique()

array(['3', '5', '2', '1', '4', '13', '15', '17', '19', '11', '12', '8',
       '9', '6', '18', '10', '7', '14', '16', '20', '21', '22', 0, '24',
       '25', '26', '23', '27', '28', 'REF'], dtype=object)

In [33]:
dX = dX.replace(to_replace="REF",value=30)

In [34]:
final_df = dX.astype({"Track_position": float})

In [35]:
final_df.dtypes

Date                object
course              object
band                object
Distance             int64
Track_condition     object
season               int64
race_group          object
race_type           object
Race_Money         float64
trainer             object
jockey              object
Track_position     float64
age                  int64
Weight               int64
gear                object
Top_speed          float64
Winner               int64
prize_money        float64
dtype: object

In [36]:
# Print object variable column
for col_name in final_df.columns:
    if final_df[col_name].dtypes == 'object':
        unique_cat = len(final_df[col_name].unique())
        print("Feature '{col_name}' has {unique_cat} unique categories".format(col_name=col_name, unique_cat=unique_cat))

Feature 'Date' has 4654 unique categories
Feature 'course' has 5 unique categories
Feature 'band' has 3 unique categories
Feature 'Track_condition' has 4 unique categories
Feature 'race_group' has 4 unique categories
Feature 'race_type' has 2 unique categories
Feature 'trainer' has 3 unique categories
Feature 'jockey' has 3 unique categories
Feature 'gear' has 5 unique categories

In [37]:
# Print numerical columns
for col_name in final_df.columns:
    if final_df[col_name].dtypes == 'float64':
        unique_cat = len(final_df[col_name].unique())
        print("Feature '{col_name}' has {unique_cat} unique categories".format(col_name=col_name, unique_cat=unique_cat))

Feature 'Race_Money' has 3781 unique categories
Feature 'Track_position' has 30 unique categories
Feature 'Top_speed' has 175 unique categories
Feature 'prize_money' has 7206 unique categories

In [38]:
final_df.isnull().sum()

Date               0
course             0
band               0
Distance           0
Track_condition    0
season             0
race_group         0
race_type          0
Race_Money         0
trainer            0
jockey             0
Track_position     0
age                0
Weight             0
gear               0
Top_speed          0
Winner             0
prize_money        0
dtype: int64

In [39]:
final_df.duplicated()

189       False
191       False
297       False
387       False
432       False
          ...
744325    False
744327    False
744328    False
744345    False
744346    False
Length: 140461, dtype: bool

In [40]:
final_df.head(2)

,Date,course,band,Distance,Track_condition,season,race_group,race_type,Race_Money,trainer,jockey,Track_position,age,Weight,gear,Top_speed,Winner,prize_money
189,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,3.0,5,157,t,93.0,0,852.0
191,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,5.0,4,150,t,79.0,0,0.0

In [41]:
final_df.shape

(140461, 18)

In [42]:
final_df.reset_index(drop=True, inplace=True)

In [43]:
final_df.head(2)

,Date,course,band,Distance,Track_condition,season,race_group,race_type,Race_Money,trainer,jockey,Track_position,age,Weight,gear,Top_speed,Winner,prize_money
0,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,3.0,5,157,t,93.0,0,852.0
1,2005-06-02,other,other,3200,other,5,Hurdle,Handicap,11568.0,other,other,5.0,4,150,t,79.0,0,0.0

In [44]:
final_df.to_csv('madata.csv', index=False)

In [45]:
final_df.to_csv('machine_data.csv', index=False)

In [46]:
final_df.to_csv('machine1_data.csv', index=False)

In [47]:
final_df.to_csv('machine11_data.csv', index=False)